test/src/test/testtool/EsbSoapValidator/23/in.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<MessageHeader xmlns="http://nn.nl/XSD/Generic/MessageHeader/2">
			<From>
				<Id>IJA_Toegang</Id>
			</From>
			<To>
				<Location>ESB.CustomerAdministration.TS.Party.PartyBIK_DNA.1.GetPartyRecursiveRoleInsurance.1.Request</Location>
			</To>
			<HeaderFields>
				<CPAId>n/a</CPAId>
				<ConversationId>lies.simsom.biz_0ace007f--7325aadd_152f455fd17_-7ccf</ConversationId>
				<MessageId>lies.simsom.biz_0ace007f--7325aadd_152f455fd17_-7cce</MessageId>
				<Timestamp>2016-02-19T07:00:12</Timestamp>
			</HeaderFields>
			<Service>
				<Name>Party</Name>
				<Context>PartyBIK_DNA</Context>
				<Action>
					<Paradigm>Request</Paradigm>
					<Name>GetPartyRecursiveRoleInsurance</Name>
					<Version>1</Version>
				</Action>
			</Service>
		</MessageHeader>
	</soapenv:Header>
	<soapenv:Body>
		<GetPaymentReferenceAndPayLink_Request xmlns="http://nn.nl/XSD/AccountInformation/AccountInformation/1/GetPaymentReferenceAndPayLink/1">
			<Debtor>
				<LastName>LastName</LastName>
				<FirstName>FirstName</FirstName>
				<Partner>BPID</Partner>
			</Debtor>
			<Contract>12334667368</Contract>
			<PayableItems>
				<DocumentNumber>123</DocumentNumber>
				<RepetitionItem>I1</RepetitionItem>
				<DocumentItemNumber>1</DocumentItemNumber>
				<SubItem>1a</SubItem>
			</PayableItems>
			<PayableItems>
				<DocumentNumber>345</DocumentNumber>
				<RepetitionItem>I2</RepetitionItem>
				<DocumentItemNumber>2</DocumentItemNumber>
				<SubItem>2a</SubItem>
			</PayableItems>
			<TotalAmount>1090</TotalAmount>
			<Invoice>
				<Description>description</Description>
				<Date>1957-08-13</Date>
				<DueDate>2016-08-13</DueDate>
			</Invoice>
			<PaymentData>
				<BatchId>12345</BatchId>
				<Concerning>concerning</Concerning>
				<ExpirationDate>2016-08-10</ExpirationDate>
				<ReturnURL>www.nn.nl/</ReturnURL>
			</PaymentData>
		</GetPaymentReferenceAndPayLink_Request>
	</soapenv:Body>
</soapenv:Envelope>
